Sub MainSub()

    ' =========================================
    ' 🔷数值类型
    '   整数 → 用 Long，别用 Integer
    '   小数 → 用 Double
    '   金额 → 用 Currency（避免精度问题）
    ' =========================================
    ' 常用整数类型
    '   范围±21亿
    Dim num1 As Long: num1 = 10
    ' Integer虽然也是整数类型, 但是不常用
    '   范围: -32,768 ~ 32,767
    Dim num2 As Integer: num2 = 20
    ' 常用浮点数类型
    Dim num3 As Double: num3 = 2.5
    ' 金额专用, 精确到小数4位
    Dim num4 As Currency: num4 = 2.5556

    ' =========================================
    ' 🔷字符串类型
    ' =========================================
    Dim str1 As String: name = "Hello"

    ' =========================================
    ' 🔷布尔类型
    ' =========================================
    Dim flag As Boolean: flag = True

    ' =========================================
    ' 🔷日期类型
    ' =========================================
    Dim d As Date: d = Now

    ' =========================================
    ' 🔷变体类型, 可以存任何类型
    '   万能类型, 但是需要慎重使用
    '
    ' 👉 特点：
    '   自动类型转换
    '   性能差、容易出 bug
    ' =========================================
    Dim v As Variant
    v = 123
    v = "abc"
End Sub