' ==============================================================
' 🔷参照下面的层级关系
' Application（Excel 整个程序）
' │
' ├── Workbooks（所有打开的Excel文件）
' │    │
' │    ├── Workbook（一个Excel文件）
' │    │     │
' │    │     ├── Worksheets（一个Excel文件里的所有Sheet页集合）
' │    │     │     │
' │    │     │     ├── Worksheet（一个Sheet页对象）
' │    │     │     │     │
' │    │     │     │     ├── Range（单元格/区域）
' │    │     │     │     │     └── Value（值）
' │    │     │     │     │
' │    │     │     │     ├── Cells（单个单元格）
' │    │     │     │     └── Columns / Rows
' │    │     ├── Sheets（包含图表等）
' │    │     └── Names（命名区域）
' ├── ActiveWorkbook（当前工作簿）
' ├── ActiveSheet（当前工作表）
' └── Selection（当前选中区域）
' ==============================================================

' ==============================================================
' 🔷工作簿
'   Workbooks
'       代表工作簿集合，所有的工作簿,Workbooks(N)，表示已打开的第N个工作簿
'   Workbooks ("工作簿名称")
'       获取指定的工作簿对象
'   ActiveWorkbook
'       正在操作的工作簿
'   ThisWorkBook
'       代码所在的工作簿
' ==============================================================

' ==============================================================
' 🔷工作表
'   Sheets("工作表名称")
'       获取指定的Sheet页对象
'   Sheet1
'       表示第1个插入的工作表
'       注意: 并不是Sheet页的名字叫Sheet1
'       只是表示第1个插入的工作表而已
'   Sheet2
'       表示第2个插入的工作表
'   Sheets(n)
'       表示按排列顺序，第n个工作表
'   ActiveSheet
'       表示活动工作表，光标所在工作表
'   worksheet
'       表示工作表，但不包括图表工作表、宏工作表等。
' ==============================================================

' ==============================================================
' 🔷单元格
'   cells
'       所有单元格
'   Range("单元格地址")
'       指定的单元格
'   Cells(行数,列数)
'       指定的单元格
'   Activecell
'       正在选中或编辑的单元格
'   Selection
'       正被选中或选取的单元格或单元格区域
' ==============================================================
